FH4/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -3 	-2.5 	-0.90)	//0
	( -0.8	-2.5	-0.90)	//1
	(  0.8	-2.5	-0.90)	//2
	(  3	-2.5	-0.90)	//3
	(  3	-0.8	-0.90)	//4
	(  0.8	-0.8	-0.90)	//5
	( -0.8	-0.8	-0.90)	//6
	( -3	-0.8	-0.90)	//7

	( -3	-2.5 	-0.40)	//8 
	( -0.8	-2.5	-0.40)  //9
	(  0.8	-2.5	-0.40)	//10
	(  3	-2.5	-0.40)	//11
	(  3	-0.8	-0.40)	//12
	(  0.8	-0.8	-0.40)	//13
	( -0.8	-0.8	-0.40)	//14
	( -3	-0.8	-0.40)	//15

	( -3	-2.5	 0.40)	//16
	( -0.8	-2.5	 0.40)	//17
	(  0.8	-2.5	 0.40)	//18
	(  3	-2.5	 0.40)	//19
	(  3	-0.8	 0.40)	//20
	(  0.8	-0.8	 0.40)	//21
	( -0.8	-0.8	 0.40)	//22
	( -3	-0.8	 0.40)	//23

	( -3	-2.5	 0.45)	//24
	( -0.8	-2.5	 0.45)	//25
	(  0.8	-2.5	 0.45)	//26
	(  3	-2.5	 0.45)	//27
	(  3	-0.8	 0.45)	//28
	(  0.8	-0.8	 0.45)	//29
	( -0.8	-0.8	 0.45)	//30
	( -3	-0.8	 0.45)	//31
	

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Using second index number
    ( -3	0.8 -0.90)	//64	32
	( -0.8	0.8	-0.90)	//65	33
	(  0.8	0.8	-0.90)	//66	34
	(  3	0.8	-0.90)	//67	35
	(  3	2.5	-0.90)	//68	36
	(  0.8	2.5	-0.90)	//69	37
	( -0.8	2.5	-0.90)	//70	38
	( -3	2.5	-0.90)	//71	39

	( -3	0.8 -0.40)	//72	40
	( -0.8	0.8	-0.40)  //73	41
	(  0.8	0.8	-0.40)	//74	42
	(  3	0.8	-0.40)	//75	43
	(  3	2.5	-0.40)	//76	44
	(  0.8	2.5	-0.40)	//77	45
	( -0.8	2.5	-0.40)	//78	46
	( -3	2.5	-0.40)	//79	47

	( -3	0.8	 0.40)	//80	48
	( -0.8	0.8	 0.40)	//81	49
	(  0.8	0.8	 0.40)	//82	50
	(  3	0.8	 0.40)	//83	51
	(  3	2.5	 0.40)	//84	52
	(  0.8	2.5	 0.40)	//85	53
	( -0.8	2.5	 0.40)	//86	54
	( -3	2.5	 0.40)	//87	55

	( -3	0.8	 0.45)	//88	56
	( -0.8	0.8	 0.45)	//89	57
	(  0.8	0.8	 0.45)	//90	58
	(  3	0.8	 0.45)	//91	59
	(  3	2.5	 0.45)	//92	60
	(  0.8	2.5	 0.45)	//93	61
	( -0.8	2.5	 0.45)	//94	62
	( -3	2.5	 0.45)	//95	63
);


blocks
(
hex (0 1 6 7 8 9 14 15) (76 59 17) simpleGrading (0.5 0.5 0.5)		//b0
hex (1 2 5 6 9 10 13 14) (80 59 17) simpleGrading (1 0.5 0.5)	  	//b1
hex (2 3 4 5 10 11 12 13) (76 59 17) simpleGrading (2 0.5 0.5)		//b2

hex (8 9 14 15 16 17 22 23) (76 59 40) simpleGrading (0.5 0.5 1)	//b3
hex (9 10 13 14 17 18 21 22) (80 59 40) simpleGrading (1 0.5 1)	//b4 *
hex (10 11 12 13 18 19 20 21) (76 59 40) simpleGrading (2 0.5 1)	//b5

hex (16 17 22 23 24 25 30 31) (76 59 2) simpleGrading (0.5 0.5 1)	//b6	
hex (17 18 21 22 25 26 29 30) (80 59 2) simpleGrading (1 0.5 1)	//b7
hex (18 19 20 21 26 27 28 29) (76 59 2) simpleGrading (2 0.5 1)	//b8

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hex (7 6 33 32 15 14 41 40) (76 80 17) simpleGrading (0.5 1 0.5)	//b9
hex (6 5 34 33 14 13 42 41) (80 80 17) simpleGrading (1 1 0.5)	//b10
hex (5 4 35 34 13 12 43 42) (76 80 17) simpleGrading (2 1 0.5)	//b11

hex (15 14 41 40 23 22 49 48) (76 80 40) simpleGrading (0.5 1 1)	//b12
hex (14 13 42 41 22 21 50 49) (80 80 40) simpleGrading (1 1 1)	//b13 *
hex (13 12 43 42 21 20 51 50) (76 80 40) simpleGrading (2 1 1)	//b14

hex (23 22 49 48 31 30 57 56) (76 80 2) simpleGrading (0.5 1 1)	//b15	
hex (22 21 50 49 30 29 58 57) (80 80 2) simpleGrading (1 1 1)	//b16
hex (21 20 51 50 29 28 59 58) (76 80 2) simpleGrading (2 1 1)	//b17

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

hex (32 33 38 39 40 41 46 47) (76 59 17) simpleGrading (0.5 2 0.5)	//b18
hex (33 34 37 38 41 42 45 46) (80 59 17) simpleGrading (1 2 0.5)	//b19
hex (34 35 36 37 42 43 44 45) (76 59 17) simpleGrading (2 2 0.5)	//b20

hex (40 41 46 47 48 49 54 55) (76 59 40) simpleGrading (0.5 2 1)	//b21
hex (41 42 45 46 49 50 53 54) (80 59 40) simpleGrading (1 2 1)	//b22 *
hex (42 43 44 45 50 51 52 53) (76 59 40) simpleGrading (2 2 1)	//b23

hex (48 49 54 55 56 57 62 63) (76 59 2) simpleGrading (0.5 2 1)	//b24	
hex (49 50 53 54 57 58 61 62) (80 59 2) simpleGrading (1 2 1)	//b25
hex (50 51 52 53 58 59 60 61) (76 59 2) simpleGrading (2 2 1)	//b26

);

edges
(
);

boundary
(
    oversetPatch
    {
        type overset;
        faces ();
    }

    inlet
    {
        type patch;
        faces
        (
			(0	8	15	7)
			(8	16	23	15)
			(16	24	31	23)

			(7	15	40	32)
			(15	23	48	40)
			(23	31	56	48)

			(32	40	47	39)
			(40	48	55	47)
			(48	56	63	55)
        );
    }
	
    outlet
    {
        type patch;
        faces
        (
			(3	4	12	11)
			(11	12	20	19)
			(19	20	28	27)

			(4	35	43	12)
			(12	43	51	20)
			(20	51	59	28)

			(35	36	44	43)
			(43	44	52	51)
			(51	52	60	59)
        );
    }
	
    ground
    {
        type wall;
        faces
        (
			(0	7	6	1)
			(1	6	5	2)
			(2	5	4	3)
			
			(7	32	33	6)
			(6	33	34	5)
			(5	34	35	4)

			(32	39	38	33)
			(33	34	37	38)
			(34	37	35	36)

        );
    }
	
	
    walls
    {
        type wall;
        faces
        (
			(0	1	9	8)
			(1	2	10	9)
			(2	3	11	10)

			(8	9	16	17)
			(9	10	18	17)
			(10	11	19	18)

			(16	17	25	24)
			(17	18	26	25)
			(18	19	27	26)	//front


			(38	39	47	46)
			(37	38	46	45)
			(36	37	45	44)

			(46	47	55	54)
			(45	46	54	53)
			(44	45	53	52)

			(54	55	63	62)
			(53	54	62	61)
			(52	53	61	60)	//back
        );
    }
	
    atmosphere
    {
        type patch;
        faces
        (
			(24	25	30	31)
			(25	26	29	30)
			(26	27	28	29)

			(31	30	57	56)
			(30	29	58	57)
			(29	28	59	58)

			(56	57	62	63)
			(57	58	61	62)
			(58	59	60	61)
        );
    }
	
	floatingObject
    {
        type wall;
        faces ();
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
